MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFR32BG27C320F768GJ39/mcu.h
/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(EFR32BG27C320F768GJ39)
#define EFR32BG27C320F768GJ39    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER                                       "EFR32BG27C320F768GJ39" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFR32_BLUE_FAMILY                                1                                   /** Device Family Name Identifier */
#define _EFR32_BG_FAMILY                                  1                                   /** Device Family Identifier */
#define _EFR_DEVICE                                       1                                   /** Product Line Identifier */
#define _SILICON_LABS_32B_SERIES_2                                                            /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES                          2                                   /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_7                                                   /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG                 7                                   /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID                 230                                 /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_230                                                 /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_SE                 0                                   /** Mid */
#define _SILICON_LABS_SECURITY_FEATURE_VAULT              1                                   /** High */
#define _SILICON_LABS_SECURITY_FEATURE_ROT                2                                   /** Root Of Trust */
#define _SILICON_LABS_SECURITY_FEATURE_BASE               3                                   /** Base */
#define _SILICON_LABS_SECURITY_FEATURE                    _SILICON_LABS_SECURITY_FEATURE_ROT  /** Security feature set */
#define _SILICON_LABS_DCDC_FEATURE_NOTUSED                0                                   /** Not Used */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BUCK              1                                   /** Includes Buck DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOOST             2                                   /** Includes Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE_DCDC_BOB               3                                   /** Includes Buck or Boost DCDC */
#define _SILICON_LABS_DCDC_FEATURE                        _SILICON_LABS_DCDC_FEATURE_DCDC_BOB /** DCDC feature set */
#define _SILICON_LABS_EFR32_RADIO_NONE                    0                                   /** No radio present */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ                  1                                   /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ                   2                                   /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND                3                                   /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE                    _SILICON_LABS_EFR32_RADIO_2G4HZ     /** Radio type */
#define _SILICON_LABS_EFR32_2G4HZ_HP_PA_MAX_OUTPUT_DBM    4                                   /** Radio 2G4HZ HP PA output power */
#define _SILICON_LABS_EFR32_2G4HZ_LP_PA_MAX_OUTPUT_DBM    0                                   /** Radio 2G4HZ LP PA output power */
#define _SILICON_LABS_EFR32_2G4HZ_HP_PA_PRESENT                                               /** Radio 2G4HZ HP PA is present */
#define _SILICON_LABS_EFR32_2G4HZ_LP_PA_PRESENT                                               /** Radio 2G4HZ LP PA is present */
#define LFRCO_PRECISION_MODE                              1                                   /** Precision mode of LFRCO enabled or disabled */

/** Memory Base addresses and limits */
#define FLASH_MEM_BASE                                    (0x08000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE                                    (0x000C0000UL) /** FLASH_MEM available address space */
#define FLASH_MEM_END                                     (0x080BFFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS                                    (0x14UL)       /** FLASH_MEM used bits */
#define MSC_FLASH_MEM_BASE                                (0x08000000UL) /** MSC_FLASH_MEM base address */
#define MSC_FLASH_MEM_SIZE                                (0x000C0000UL) /** MSC_FLASH_MEM available address space */
#define MSC_FLASH_MEM_END                                 (0x080BFFFFUL) /** MSC_FLASH_MEM end address */
#define MSC_FLASH_MEM_BITS                                (0x14UL)       /** MSC_FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE                       (0x0FE00000UL) /** MSC_FLASH_USERDATA_MEM base address */
#define MSC_FLASH_USERDATA_MEM_SIZE                       (0x00000400UL) /** MSC_FLASH_USERDATA_MEM available address space */
#define MSC_FLASH_USERDATA_MEM_END                        (0x0FE003FFUL) /** MSC_FLASH_USERDATA_MEM end address */
#define MSC_FLASH_USERDATA_MEM_BITS                       (0xBUL)        /** MSC_FLASH_USERDATA_MEM used bits */
#define USERDATA_BASE                                     (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE                                     (0x00000400UL) /** USERDATA available address space */
#define USERDATA_END                                      (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS                                     (0xBUL)        /** USERDATA used bits */
#define MSC_FLASH_DEVINFO_MEM_BASE                        (0x0FE08000UL) /** MSC_FLASH_DEVINFO_MEM base address */
#define MSC_FLASH_DEVINFO_MEM_SIZE                        (0x00000400UL) /** MSC_FLASH_DEVINFO_MEM available address space */
#define MSC_FLASH_DEVINFO_MEM_END                         (0x0FE083FFUL) /** MSC_FLASH_DEVINFO_MEM end address */
#define MSC_FLASH_DEVINFO_MEM_BITS                        (0xBUL)        /** MSC_FLASH_DEVINFO_MEM used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE                     (0x0FE08400UL) /** MSC_FLASH_CHIPCONFIG_MEM base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE                     (0x00000600UL) /** MSC_FLASH_CHIPCONFIG_MEM available address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END                      (0x0FE089FFUL) /** MSC_FLASH_CHIPCONFIG_MEM end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS                     (0xBUL)        /** MSC_FLASH_CHIPCONFIG_MEM used bits */
#define DMEM_RAM0_RAM_MEM_BASE                            (0x20000000UL) /** DMEM_RAM0_RAM_MEM base address */
#define DMEM_RAM0_RAM_MEM_SIZE                            (0x00010000UL) /** DMEM_RAM0_RAM_MEM available address space */
#define DMEM_RAM0_RAM_MEM_END                             (0x2000FFFFUL) /** DMEM_RAM0_RAM_MEM end address */
#define DMEM_RAM0_RAM_MEM_BITS                            (0x11UL)       /** DMEM_RAM0_RAM_MEM used bits */
#define RAM_MEM_BASE                                      (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE                                      (0x00010000UL) /** RAM_MEM available address space */
#define RAM_MEM_END                                       (0x2000FFFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS                                      (0x11UL)       /** RAM_MEM used bits */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_BASE                  (0x4C024000UL) /** CRYPTOACC_RNGOUT_FIFO_S_MEM base address */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_SIZE                  (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_S_MEM available address space */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_END                   (0x4C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_S_MEM end address */
#define CRYPTOACC_RNGOUT_FIFO_S_MEM_BITS                  (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_S_MEM used bits */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_BASE                   (0x4C028000UL) /** CRYPTOACC_PKRAM_MAIN_S_MEM base address */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_SIZE                   (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_S_MEM available address space */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_END                    (0x4C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_S_MEM end address */
#define CRYPTOACC_PKRAM_MAIN_S_MEM_BITS                   (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_S_MEM used bits */
#define CRYPTOACC_PKROM_MAIN_S_MEM_BASE                   (0x4C02C000UL) /** CRYPTOACC_PKROM_MAIN_S_MEM base address */
#define CRYPTOACC_PKROM_MAIN_S_MEM_SIZE                   (0x00001128UL) /** CRYPTOACC_PKROM_MAIN_S_MEM available address space */
#define CRYPTOACC_PKROM_MAIN_S_MEM_END                    (0x4C02D127UL) /** CRYPTOACC_PKROM_MAIN_S_MEM end address */
#define CRYPTOACC_PKROM_MAIN_S_MEM_BITS                   (0xDUL)        /** CRYPTOACC_PKROM_MAIN_S_MEM used bits */
#define CRYPTOACC_PKROM_SPACER_S_MEM_BASE                 (0x4C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_S_MEM base address */
#define CRYPTOACC_PKROM_SPACER_S_MEM_SIZE                 (0x00000001UL) /** CRYPTOACC_PKROM_SPACER_S_MEM available address space */
#define CRYPTOACC_PKROM_SPACER_S_MEM_END                  (0x4C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_S_MEM end address */
#define CRYPTOACC_PKROM_SPACER_S_MEM_BITS                 (0x1UL)        /** CRYPTOACC_PKROM_SPACER_S_MEM used bits */
#define CRYPTOACC_RNGOUT_FIFO_MEM_BASE                    (0x5C024000UL) /** CRYPTOACC_RNGOUT_FIFO_MEM base address */
#define CRYPTOACC_RNGOUT_FIFO_MEM_SIZE                    (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_MEM available address space */
#define CRYPTOACC_RNGOUT_FIFO_MEM_END                     (0x5C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_MEM end address */
#define CRYPTOACC_RNGOUT_FIFO_MEM_BITS                    (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_MEM used bits */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_BASE                 (0x5C024000UL) /** CRYPTOACC_RNGOUT_FIFO_NS_MEM base address */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_SIZE                 (0x00004000UL) /** CRYPTOACC_RNGOUT_FIFO_NS_MEM available address space */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_END                  (0x5C027FFFUL) /** CRYPTOACC_RNGOUT_FIFO_NS_MEM end address */
#define CRYPTOACC_RNGOUT_FIFO_NS_MEM_BITS                 (0xFUL)        /** CRYPTOACC_RNGOUT_FIFO_NS_MEM used bits */
#define CRYPTOACC_PKRAM_MAIN_MEM_BASE                     (0x5C028000UL) /** CRYPTOACC_PKRAM_MAIN_MEM base address */
#define CRYPTOACC_PKRAM_MAIN_MEM_SIZE                     (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_MEM available address space */
#define CRYPTOACC_PKRAM_MAIN_MEM_END                      (0x5C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_MEM end address */
#define CRYPTOACC_PKRAM_MAIN_MEM_BITS                     (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_MEM used bits */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_BASE                  (0x5C028000UL) /** CRYPTOACC_PKRAM_MAIN_NS_MEM base address */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_SIZE                  (0x00001000UL) /** CRYPTOACC_PKRAM_MAIN_NS_MEM available address space */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_END                   (0x5C028FFFUL) /** CRYPTOACC_PKRAM_MAIN_NS_MEM end address */
#define CRYPTOACC_PKRAM_MAIN_NS_MEM_BITS                  (0xDUL)        /** CRYPTOACC_PKRAM_MAIN_NS_MEM used bits */
#define CRYPTOACC_PKROM_MAIN_MEM_BASE                     (0x5C02C000UL) /** CRYPTOACC_PKROM_MAIN_MEM base address */
#define CRYPTOACC_PKROM_MAIN_MEM_SIZE                     (0x00001128UL) /** CRYPTOACC_PKROM_MAIN_MEM available address space */
#define CRYPTOACC_PKROM_MAIN_MEM_END                      (0x5C02D127UL) /** CRYPTOACC_PKROM_MAIN_MEM end address */
#define CRYPTOACC_PKROM_MAIN_MEM_BITS                     (0xDUL)        /** CRYPTOACC_PKROM_MAIN_MEM used bits */
#define CRYPTOACC_PKROM_MAIN_NS_MEM_BASE                  (0x5C02C000UL) /** CRYPTOACC_PKROM_MAIN_NS_MEM base address */
#define CRYPTOACC_PKROM_MAIN_NS_MEM_SIZE                  (0x00001128UL) /** CRYPTOACC_PKROM_MAIN_NS_MEM available address space */
#define CRYPTOACC_PKROM_MAIN_NS_MEM_END                   (0x5C02D127UL) /** CRYPTOACC_PKROM_MAIN_NS_MEM end address */
#define CRYPTOACC_PKROM_MAIN_NS_MEM_BITS                  (0xDUL)        /** CRYPTOACC_PKROM_MAIN_NS_MEM used bits */
#define CRYPTOACC_PKROM_SPACER_MEM_BASE                   (0x5C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_MEM base address */
#define CRYPTOACC_PKROM_SPACER_MEM_SIZE                   (0x00000001UL) /** CRYPTOACC_PKROM_SPACER_MEM available address space */
#define CRYPTOACC_PKROM_SPACER_MEM_END                    (0x5C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_MEM end address */
#define CRYPTOACC_PKROM_SPACER_MEM_BITS                   (0x1UL)        /** CRYPTOACC_PKROM_SPACER_MEM used bits */
#define CRYPTOACC_PKROM_SPACER_NS_MEM_BASE                (0x5C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_NS_MEM base address */
#define CRYPTOACC_PKROM_SPACER_NS_MEM_SIZE                (0x00000001UL) /** CRYPTOACC_PKROM_SPACER_NS_MEM available address space */
#define CRYPTOACC_PKROM_SPACER_NS_MEM_END                 (0x5C02FFFFUL) /** CRYPTOACC_PKROM_SPACER_NS_MEM end address */
#define CRYPTOACC_PKROM_SPACER_NS_MEM_BITS                (0x1UL)        /** CRYPTOACC_PKROM_SPACER_NS_MEM used bits */
#define RDMEM_SEQRAM_S_MEM_BASE                           (0xA0000000UL) /** RDMEM_SEQRAM_S_MEM base address */
#define RDMEM_SEQRAM_S_MEM_SIZE                           (0x00004000UL) /** RDMEM_SEQRAM_S_MEM available address space */
#define RDMEM_SEQRAM_S_MEM_END                            (0xA0003FFFUL) /** RDMEM_SEQRAM_S_MEM end address */
#define RDMEM_SEQRAM_S_MEM_BITS                           (0xFUL)        /** RDMEM_SEQRAM_S_MEM used bits */
#define RDMEM_FRCRAM_S_MEM_BASE                           (0xA0004000UL) /** RDMEM_FRCRAM_S_MEM base address */
#define RDMEM_FRCRAM_S_MEM_SIZE                           (0x00001000UL) /** RDMEM_FRCRAM_S_MEM available address space */
#define RDMEM_FRCRAM_S_MEM_END                            (0xA0004FFFUL) /** RDMEM_FRCRAM_S_MEM end address */
#define RDMEM_FRCRAM_S_MEM_BITS                           (0xDUL)        /** RDMEM_FRCRAM_S_MEM used bits */
#define RDMEM_SEQRAM_NS_MEM_BASE                          (0xB0000000UL) /** RDMEM_SEQRAM_NS_MEM base address */
#define RDMEM_SEQRAM_NS_MEM_SIZE                          (0x00004000UL) /** RDMEM_SEQRAM_NS_MEM available address space */
#define RDMEM_SEQRAM_NS_MEM_END                           (0xB0003FFFUL) /** RDMEM_SEQRAM_NS_MEM end address */
#define RDMEM_SEQRAM_NS_MEM_BITS                          (0xFUL)        /** RDMEM_SEQRAM_NS_MEM used bits */
#define RDMEM_SEQRAM_SEQRAM_MEM_BASE                      (0xB0000000UL) /** RDMEM_SEQRAM_SEQRAM_MEM base address */
#define RDMEM_SEQRAM_SEQRAM_MEM_SIZE                      (0x00004000UL) /** RDMEM_SEQRAM_SEQRAM_MEM available address space */
#define RDMEM_SEQRAM_SEQRAM_MEM_END                       (0xB0003FFFUL) /** RDMEM_SEQRAM_SEQRAM_MEM end address */
#define RDMEM_SEQRAM_SEQRAM_MEM_BITS                      (0xFUL)        /** RDMEM_SEQRAM_SEQRAM_MEM used bits */
#define RDMEM_FRCRAM_FRCRAM_MEM_BASE                      (0xB0004000UL) /** RDMEM_FRCRAM_FRCRAM_MEM base address */
#define RDMEM_FRCRAM_FRCRAM_MEM_SIZE                      (0x00001000UL) /** RDMEM_FRCRAM_FRCRAM_MEM available address space */
#define RDMEM_FRCRAM_FRCRAM_MEM_END                       (0xB0004FFFUL) /** RDMEM_FRCRAM_FRCRAM_MEM end address */
#define RDMEM_FRCRAM_FRCRAM_MEM_BITS                      (0xDUL)        /** RDMEM_FRCRAM_FRCRAM_MEM used bits */
#define RDMEM_FRCRAM_NS_MEM_BASE                          (0xB0004000UL) /** RDMEM_FRCRAM_NS_MEM base address */
#define RDMEM_FRCRAM_NS_MEM_SIZE                          (0x00001000UL) /** RDMEM_FRCRAM_NS_MEM available address space */
#define RDMEM_FRCRAM_NS_MEM_END                           (0xB0004FFFUL) /** RDMEM_FRCRAM_NS_MEM end address */
#define RDMEM_FRCRAM_NS_MEM_BITS                          (0xDUL)        /** RDMEM_FRCRAM_NS_MEM used bits */

